In [3]:
import numpy as np

import pandas as pd

In [4]:
# 创建最简单的Series
obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
# values属性
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
# index属性
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'c', 'b', 'a'])

obj2

d    4
c    7
b   -5
a    3
dtype: int64

In [8]:
# 通过索引的方式选取Series的值
obj2['a']

3

In [9]:
obj2['d'] = 6

obj2[['c', 'a', 'd']]

c    7
a    3
d    6
dtype: int64

In [10]:
obj2[obj2 > 0]

d    6
c    7
a    3
dtype: int64

In [11]:
obj2 * 2

d    12
c    14
b   -10
a     6
dtype: int64

In [12]:
np.exp(obj2)

d     403.428793
c    1096.633158
b       0.006738
a      20.085537
dtype: float64

In [13]:
'b' in obj2

True

In [14]:
'e' in obj2

False

In [15]:
# 将python字典转化为Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Utah': 5000}

obj3 = pd.Series(sdata)

obj3

Ohio     35000
Texas    71000
Utah      5000
dtype: int64

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, index=states)

obj4

California        NaN
Ohio          35000.0
Oregon            NaN
Texas         71000.0
dtype: float64

In [17]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon         True
Texas         False
dtype: bool

In [18]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon        False
Texas          True
dtype: bool

In [19]:
obj4.isnull()

California     True
Ohio          False
Oregon         True
Texas         False
dtype: bool

In [20]:
obj3

Ohio     35000
Texas    71000
Utah      5000
dtype: int64

In [21]:
obj4

California        NaN
Ohio          35000.0
Oregon            NaN
Texas         71000.0
dtype: float64

In [22]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon             NaN
Texas         142000.0
Utah               NaN
dtype: float64

In [23]:
obj4.name = 'population'

In [24]:
obj4.index.name = 'state'

In [25]:
obj4

state
California        NaN
Ohio          35000.0
Oregon            NaN
Texas         71000.0
Name: population, dtype: float64

In [26]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [27]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [29]:
# 按照列顺序排列
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five', 'six'])
    
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [31]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [34]:
frame2['debt'] = 1188

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  1188
two    2001    Ohio  1.7  1188
three  2002    Ohio  3.6  1188
four   2001  Nevada  2.4  1188
five   2002  Nevada  2.9  1188
six    2003  Nevada  3.2  1188

In [35]:
frame2['debt'] = np.arange(6.)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [36]:
val = pd.Series([-1.2, -1.5, -1.7], index=['one', 'two', 'three'])

frame2['debt'] = val

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  -1.2
two    2001    Ohio  1.7  -1.5
three  2002    Ohio  3.6  -1.7
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   NaN

In [37]:
frame2['eastern'] = frame2.state == 'Ohio'

frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5  -1.2     True
two    2001    Ohio  1.7  -1.5     True
three  2002    Ohio  3.6  -1.7     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2   NaN    False

In [38]:
del frame2['eastern']

frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [39]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002:3.6}}

frame3 = pd.DataFrame(pop)

frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [40]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [41]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [42]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}

pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [43]:
frame3.index.name = 'year'

frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [44]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [45]:
frame2.values

array([[2000, 'Ohio', 1.5, -1.2],
       [2001, 'Ohio', 1.7, -1.5],
       [2002, 'Ohio', 3.6, -1.7],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [46]:
# 索引对象
obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [47]:
index[1:]

Index(['b', 'c'], dtype='object')

In [48]:
index[:-1]

Index(['a', 'b'], dtype='object')

In [49]:
index[:]

Index(['a', 'b', 'c'], dtype='object')

In [50]:
index[-1:]

Index(['c'], dtype='object')

In [51]:
index[0:2]

Index(['a', 'b'], dtype='object')

In [52]:
index[0:3]

Index(['a', 'b', 'c'], dtype='object')

In [53]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [ ]:
labels = pd.Index(np.arange(3))

labels

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

obj2

In [ ]:
frame3.columns

In [ ]:
'Ohio' in frame3.columns

In [ ]:
dup_labels = pd.Index(['foo', 'foo', 'too', 'too'])

dup_labels

In [ ]:
dup_labels.unique()

In [54]:
# 重新索引
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [55]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [56]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [57]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [58]:
# 丢弃指定轴上的项
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [59]:
new_obj = obj.drop('c')

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [60]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [61]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [63]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [64]:
# 索引、选取和过滤
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [66]:
# 痛哟切片或布尔型数组选取数据
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [67]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [68]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [69]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [70]:
data[data < 5] = 0

data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [71]:
# 用loc和iloc进行选取
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [72]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [73]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [74]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [75]:
# 整数索引
ser = pd.Series(np.arange(3.))

ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [76]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [77]:
ser.iloc[:1]

0    0.0
dtype: float64

In [78]:
ser[:1]

0    0.0
dtype: float64

In [79]:
# 算术运算和数据对齐
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
                                             
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [80]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [81]:
s1 +s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [82]:
df1 = pd.DataFrame({'A': [1, 2]})

df2 = pd.DataFrame({'B': [3, 4]})

df1

   A
0  1
1  2

In [83]:
df2

   B
0  3
1  4

In [84]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [85]:
# 在算术方法中填充值
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)), columns=list('abcd'))

df2 = pd.DataFrame(np.arange(20).reshape((4, 5)), columns=list('abcde'))

df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [86]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [87]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [88]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [89]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [90]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [91]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [92]:
# DataFrame和Series之间的运算
arr = np.arange(12.).reshape((3, 4))

arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [93]:
arr[0]

array([0., 1., 2., 3.])

In [94]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [95]:
# 函数的应用和映射
frame = pd.DataFrame(np.random.randn(4, 3), index=['Utah', 'Ohix', 'Texas', 'Orefon'])

frame

               0         1         2
Utah    0.561449 -0.045652  0.640766
Ohix    0.545477  1.173182  1.144526
Texas   0.140935 -0.207853 -1.108596
Orefon -0.929377  0.652225  0.763500

In [96]:
np.abs(frame)

               0         1         2
Utah    0.561449  0.045652  0.640766
Ohix    0.545477  1.173182  1.144526
Texas   0.140935  0.207853  1.108596
Orefon  0.929377  0.652225  0.763500

In [97]:
f = lambda x: x.max() - x.min()

In [98]:
frame.apply(f)

0    1.490826
1    1.381035
2    2.253122
dtype: float64

In [99]:
frame.apply(f, axis='columns')

Utah      0.686418
Ohix      0.627705
Texas     1.249531
Orefon    1.692878
dtype: float64

In [100]:
format = lambda x: '%.2f' % x

In [101]:
frame.applymap(format)

            0      1      2
Utah     0.56  -0.05   0.64
Ohix     0.55   1.17   1.14
Texas    0.14  -0.21  -1.11
Orefon  -0.93   0.65   0.76

In [102]:
frame.loc[:,2].map(format)

Utah       0.64
Ohix       1.14
Texas     -1.11
Orefon     0.76
Name: 2, dtype: object

In [103]:
# 排序和排名
obj = pd.Series(range(4), index=['d', 'a', 'c', 'b'])

obj.sort_index()

a    1
b    3
c    2
d    0
dtype: int64

In [104]:
obj.sort_index(ascending=False)

d    0
c    2
b    3
a    1
dtype: int64

In [105]:
obj.sort_values()

d    0
a    1
c    2
b    3
dtype: int64

In [106]:
obj.sort_values(ascending=False)

b    3
c    2
a    1
d    0
dtype: int64

In [107]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [108]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [109]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [110]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [111]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [112]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [113]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [114]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [115]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [116]:
# 汇总和计算描述统计
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [117]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [118]:
df.idxmax()

one    b
two    d
dtype: object

In [119]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [120]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [121]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [122]:
# 相关系数与协方差
import pandas_datareader.data as web

all_data = {}

for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

all_data

ConnectionError: HTTPSConnectionPool(host='finance.yahoo.com', port=443): Max retries exceeded with url: /quote/AAPL/history?period1=946670400&period2=1262375999&interval=1d&frequency=1d&filter=history (Caused by NewConnectionError('<urllib3.connection.VerifiedHTTPSConnection object at 0x0000014851F78358>: Failed to establish a new connection: [WinError 10060] 由于连接方在一段时间后没有正确答复或连接的主机没有反应，连接尝试失败。'))

In [123]:
# 唯一值、值计数以及成员资格
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b'])

uniques = obj.unique()

uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [124]:
price = pd.DataFrame({tic: data['Adj Close']
                         for tic, data in all_data.iteritems()})
volume = pd.DataFrame({tic: data['Volume']
                         for tic, data in all_data.iteritems()})

AttributeError: 'dict' object has no attribute 'iteritems'

In [125]:
uniques.sort()

In [126]:
# 读写文本格式的数据
parsed = pd.read_csv('example.txt', index_[])

parsed

SyntaxError: invalid syntax (<ipython-input-126-938d2fae3605>, line 2)

In [127]:
list(open('1.txt'))

['key1,key2,value1,value2\n',
 'one,a,1,2\n',
 'one,b,3,4\n',
 'one,c,5,6\n',
 'one,d,7,8\n',
 'two,a,9,10\n',
 'two,b,11,12\n',
 'two,c,13,14\n',
 'two,d,15,16']

In [130]:
result = pd.read_table('1.txt', sep='\s+')

result

E:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

  key1,key2,value1,value2
0               one,a,1,2
1               one,b,3,4
2               one,c,5,6
3               one,d,7,8
4              two,a,9,10
5             two,b,11,12
6             two,c,13,14
7             two,d,15,16

In [132]:
result.loc[0,:]

key1,key2,value1,value2    one,a,1,2
Name: 0, dtype: object

In [140]:
# 将数据写出到文本格式
data = list(open('2.txt'))

['something a b c d message\n',
 'one 1 2 3.0 4 NaN\n',
 'two 5 6 NaN 8 world\n',
 'three 9 10 11.0 12 foo']

In [141]:
np.array(data)

array([['one 1 2 3.0 4 NaN'],
       ['two 5 6 NaN 8 world'],
       ['three 9 10 11.0 12 foo']], dtype=object)

In [146]:
obj ="""
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
import json

result = json.loads(obj)

result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [147]:
asjson = json.dumps(result)

In [149]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

siblings

    name  age
0  Scott   30
1  Katie   38

In [151]:
data = pd.read_json('3.json')

data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [152]:
data.to_json()

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [156]:
# XML和HTML：Web信息收集
from io import StringIO

tag = '<a href="http://www.google.com">Google</a>'

root = objectify.parse(StringIO(tag)).getroot()

root

In [157]:
root.text

'Google'

In [159]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

In [160]:
con = sqlite3.connect('mydata.sqlite')

In [161]:
con.execute(query)

In [162]:
con.commit()